validation/pitzdaily_openfoam/of_transient/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.15;
deltaT          1e-5;
writeControl    adjustableRunTime;
writeInterval   0.02;
purgeWrite      5;
writeFormat     ascii;
writePrecision  8;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.9;
maxDeltaT       1e-4;
functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   5;
        fields          (U p);
        probeLocations
        (
            (0.02 -0.005 0)
            (0.05 -0.010 0)
            (0.10 -0.015 0)
            (0.15 -0.005 0)
        );
    }
}
