validation/pitzdaily_openfoam/of_transient/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.676137
1.26933
1.52177
1.60575
1.25329
2.89819
3.4511
2.48949
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
223
(
0.938584
1.28082
1.48366
1.58281
1.61312
1.59931
1.5716
1.52331
...
)
;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
250
(
0.676137
1.26933
1.52177
1.60575
1.25329
2.89819
3.4511
2.48949
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
