validation/pitzdaily_openfoam/of_transient/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
6.72304e-06
1.28258e-05
1.56768e-05
1.69064e-05
1.34763e-05
3.17898e-05
3.85733e-05
2.83838e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
3.7266e-06
0.000228336
0.000851982
0.000851982
0.000851982
0.000851982
0.000851982
0.000851982
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
2.43e-05
0.000304013
0.000693934
0.00111383
0.00150874
0.00185922
0.00215878
0.00240707
...
)
;
    }
    upperWall
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
223
(
0
1.01299e-06
1.67599e-06
1.98111e-06
2.07218e-06
2.03082e-06
1.94719e-06
1.79939e-06
...
)
;
    }
    lowerWall
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
2.23489e-06
3.1211e-06
1.51515e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
