validation/pitzdaily_openfoam/of_transient/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
31477.7
41113.8
39460.8
39535.6
37007.8
31477.7
31477.7
45407.7
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 440.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
223
(
18117.5
23573.4
25568.8
26506.1
26815.2
26752.4
26521
26152.9
...
)
;
    }
    lowerWall
    {
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
250
(
31477.7
41113.8
39460.8
39535.6
37007.8
31477.7
31477.7
45407.7
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
