validation/pitzdaily_openfoam/of_transient/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "2000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
24170
(
3.04023e-06
1.48185e-07
2.88013e-06
1.60151e-07
2.7341e-06
1.45998e-07
2.60279e-06
1.31333e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-3.18841e-06
-3.41725e-06
-3.66252e-06
-3.92539e-06
-4.20713e-06
-4.50909e-06
-4.83272e-06
-5.17958e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
3.19803e-06
3.44137e-06
3.51928e-06
3.57474e-06
3.62379e-06
3.67082e-06
3.7177e-06
3.76543e-06
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
