validation/pitzdaily_openfoam/of_transient/system/fvSolution
FoamFile { format ascii; class dictionary; object fvSolution; }
solvers
{
    "(p|pFinal|pcorr)"
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    "(U|k|omega)(Final)?"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }
}
PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
}
relaxationFactors { equations { ".*" 1; } }
