validation/pitzdaily_openfoam/of_transient/system/functions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals(p, U, k, omega)

// ************************************************************************* //
